[
  {
    "_id": "677f1c9a4b1d92a5f0ec1001",
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://m.media-amazon.com/images/I/81aY1lxk+9L._AC_UF1000,1000_QL80_.jpg",
    "price": 450,
    "status": "published",
    "category": "Fiction",
    "description": "Harper Lee’s timeless classic explores themes of racial injustice, morality, and human empathy in the American South. Through the innocent eyes of young Scout Finch, readers witness the harsh realities of prejudice and the quiet heroism of her father, Atticus Finch. The novel beautifully balances humor and heartbreak while offering deep reflections on society. As Scout navigates childhood curiosity, family relationships, and her community’s divided values, the book paints a vivid picture of how bias and kindness shape human behavior. Lee’s storytelling captures both the warmth of small-town life and the painful truth of inequality. Its memorable characters, emotional depth, and moral lessons continue to resonate across generations, making it one of the most influential and thought-provoking novels ever written.",
    "librarianId": "66fd12aa94d9b2f8a1c10001",
    "addedAt": "2025-01-01T13:00:00Z",
    "inStock": 12
  },
  {
    "_id": "677f1c9a4b1d92a5f0ec1002",
    "title": "1984",
    "author": "George Orwell",
    "image": "https://img.drz.lazcdn.com/static/bd/p/24c4aab1b0651de231e0f40c3c97fb3a.jpg_720x720q80.jpg",
    "price": 390,
    "status": "published",
    "category": "Dystopian",
    "description": "George Orwell’s '1984' presents a terrifying vision of a totalitarian world controlled by surveillance, propaganda, and fear. The novel follows Winston Smith, a man struggling to maintain individuality and truth in a society where independent thought is punished. Orwell masterfully exposes the dangers of absolute power, manipulated information, and the erosion of personal freedom. Through Winston’s rebellion, love, and eventual breaking point, the novel reveals how oppressive systems crush the human spirit. Concepts such as Big Brother, Newspeak, and Thoughtcrime remain profoundly relevant in modern conversations about privacy, censorship, and political manipulation. With its chilling atmosphere and powerful warnings, '1984' continues to be a stark reminder of the fragility of freedom and the importance of resisting authoritarian control.",
    "librarianId": "66fd12aa94d9b2f8a1c10002",
    "addedAt": "2025-01-02T13:00:00Z",
    "inStock": 7
  },
  {
    "_id": "677f1c9a4b1d92a5f0ec1003",
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1650033243i/41733839.jpg",
    "price": 350,
    "status": "published",
    "category": "Classic",
    "description": "Set in the dazzling Jazz Age, 'The Great Gatsby' explores the illusions of wealth, love, and the American Dream. Jay Gatsby, a mysterious millionaire with a troubled past, becomes entangled in a tragic pursuit of his lost romance with Daisy Buchanan. Through the narrator Nick Carraway, Fitzgerald creates a vivid world of glittering parties, extravagance, and moral decay. As Gatsby’s dream unravels, the novel exposes the emptiness beneath the glamorous surface of high society. Fitzgerald’s lyrical prose and unforgettable characters offer a rich commentary on ambition, desire, and the consequences of living in pursuit of an unattainable ideal. The story remains a timeless reflection on hope, class, and the disillusionment that often follows great expectations.",
    "librarianId": "66fd12aa94d9b2f8a1c10001",
    "addedAt": "2025-01-03T13:00:00Z",
    "inStock": 15
  },
  {
    "_id": "677f1c9a4b1d92a5f0ec1004",
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://m.media-amazon.com/images/I/712P0p5cXIL.jpg",
    "price": 300,
    "status": "published",
    "category": "Romance",
    "description": "Jane Austen’s beloved novel offers a witty and insightful exploration of love, class, and social expectations in 19th-century England. Elizabeth Bennet, the independent and sharp-witted protagonist, navigates family pressures, societal norms, and misunderstandings while confronting her own assumptions. Her evolving relationship with the proud yet honorable Mr. Darcy forms the heart of the story. Austen’s keen observations on human behavior bring humor, charm, and emotional depth to every chapter. The novel highlights how pride, prejudice, and miscommunication influence relationships, while also celebrating personal growth and self-reflection. Its timeless characters, elegant writing, and enduring themes of love and integrity make it one of the most cherished works in English literature.",
    "librarianId": "66fd12aa94d9b2f8a1c10003",
    "addedAt": "2025-01-04T13:00:00Z",
    "inStock": 9
  },
  {
    "_id": "677f1c9a4b1d92a5f0ec1005",
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://m.media-amazon.com/images/I/617lxveUjYL._AC_UF1000,1000_QL80_.jpg",
    "price": 420,
    "status": "published",
    "category": "Philosophy",
    "description": "Paulo Coelho’s inspirational tale follows Santiago, a young shepherd who dreams of finding a hidden treasure near the Egyptian pyramids. As he begins his journey, he encounters wise mentors, mysterious omens, and important spiritual lessons that guide him toward understanding his purpose. The novel emphasizes the significance of listening to one’s heart, trusting the universe, and embracing the personal legend within. Coelho blends simplicity with deep philosophical reflection, reminding readers that the journey itself often holds the greatest rewards. Filled with symbolism, wisdom, and encouragement, 'The Alchemist' continues to inspire millions to pursue their dreams with courage and faith.",
    "librarianId": "66fd12aa94d9b2f8a1c10003",
    "addedAt": "2025-01-05T13:00:00Z",
    "inStock": 18
  },
  {
    "_id": "677f1c9a4b1d92a5f0ec1006",
    "title": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1703329310i/23692271.jpg",
    "price": 800,
    "status": "published",
    "category": "History",
    "description": "Yuval Noah Harari presents a sweeping narrative of human evolution, tracing our species from early hunter-gatherers to the dominant force shaping the modern world. He examines how biology, culture, economics, and belief systems influenced societies across centuries. Harari breaks down complex historical transformations—such as the Cognitive Revolution, Agricultural Revolution, and Scientific Revolution—in a clear and engaging way. The book challenges readers to rethink familiar ideas about progress, happiness, and human behavior. With bold insights and thought-provoking arguments, 'Sapiens' bridges science and philosophy while offering a compelling look into what makes humans unique. It remains one of the most influential works on human history and our place in the world.",
    "librarianId": "66fd12aa94d9b2f8a1c10004",
    "addedAt": "2025-01-06T13:00:00Z",
    "inStock": 5
  },
  {
    "_id": "677f1c9a4b1d92a5f0ec1007",
    "title": "Atomic Habits",
    "author": "James Clear",
    "image": "https://m.media-amazon.com/images/I/81kg51XRc1L._SL1500_.jpg",
    "price": 650,
    "status": "published",
    "category": "Self-help",
    "description": "James Clear provides a practical and science-backed guide to building better habits through small, consistent actions. The book explains how tiny changes, when repeated over time, create remarkable long-term results. Clear breaks down the psychology behind habits, using simple frameworks, relatable examples, and actionable strategies. He highlights the importance of identity, environment, and systems in shaping behavior. With its clarity and practicality, 'Atomic Habits' helps readers break bad routines, build positive ones, and create lasting personal growth. It is widely praised for its accessible writing style and its ability to turn complex behavioral science into everyday wisdom that anyone can apply.",
    "librarianId": "66fd12aa94d9b2f8a1c10005",
    "addedAt": "2025-01-07T13:00:00Z",
    "inStock": 20
  },
  {
    "_id": "677f1c9a4b1d92a5f0ec1008",
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://m.media-amazon.com/images/I/81uEDUfKBZL._AC_UF894,1000_QL80_.jpg",
    "price": 500,
    "status": "published",
    "category": "Fantasy",
    "description": "This enchanting fantasy novel follows Bilbo Baggins, a reluctant hobbit who is swept into an unexpected adventure with a group of dwarves and the wizard Gandalf. Together, they journey across Middle-earth, encountering trolls, goblins, elves, giant spiders, and the fearsome dragon Smaug. Tolkien’s richly imagined world captivates readers with its landscapes, myths, and unforgettable characters. As Bilbo faces challenges and discovers his courage, the story blends humor, bravery, and moments of deep reflection. Serving as the foundation for the later 'Lord of the Rings' trilogy, 'The Hobbit' remains one of the most beloved and influential fantasy novels ever written.",
    "librarianId": "66fd12aa94d9b2f8a1c10002",
    "addedAt": "2025-01-08T13:00:00Z",
    "inStock": 14
  },
  {
    "_id": "677f1c9a4b1d92a5f0ec1009",
    "title": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/89/The_Catcher_in_the_Rye_%281951%2C_first_edition_cover%29.jpg",
    "price": 360,
    "status": "published",
    "category": "Classic",
    "description": "J.D. Salinger’s iconic novel follows Holden Caulfield, a disillusioned teenager wandering through New York City after being expelled from school. Through his cynical yet sensitive voice, the story captures the confusion, rebellion, and loneliness of adolescence. Holden’s reflections on authenticity, innocence, and the ‘phoniness’ he sees in the adult world reveal the emotional struggles many young people face. The novel’s intimate narrative style draws readers into Holden’s inner turmoil as he seeks meaning, connection, and clarity. For decades, the book has sparked conversations about youth identity, mental health, and societal expectations. It remains a powerful and relatable exploration of growing up.",
    "librarianId": "66fd12aa94d9b2f8a1c10004",
    "addedAt": "2025-01-09T13:00:00Z",
    "inStock": 11
  },
  {
    "_id": "677f1c9a4b1d92a5f0ec1010",
    "title": "A Brief History of Time",
    "author": "Stephen Hawking",
    "image": "https://kindlebd.com/wp-content/uploads/2025/06/A1WTURKqwyL.jpg",
    "price": 750,
    "status": "published",
    "category": "Science",
    "description": "Stephen Hawking distills complex scientific concepts—such as black holes, the Big Bang, and quantum mechanics—into clear and accessible explanations for general readers. The book explores humanity’s quest to understand the origins, structure, and future of the universe. Hawking’s curiosity, brilliance, and ability to simplify advanced ideas make the journey both educational and deeply inspiring. He takes readers through the mysteries of time, space, and the laws that govern everything we know. With its blend of science, philosophy, and wonder, 'A Brief History of Time' has become one of the most influential works in popular science, encouraging countless readers to look at the cosmos with newfound fascination.",
    "librarianId": "66fd12aa94d9b2f8a1c10001",
    "addedAt": "2025-01-10T13:00:00Z",
    "inStock": 6
  }
]
